               
let questions = {
   1: 'தமிழ் எழுத்துக்கள் மொத்தம் எத்தனை',
   2: 'ஆசிரியப்பாவின் ஈற்றுச்சீர் ________ முடிவது சிறப்பு',
   3: 'மரபு பிழையை நீக்கிய தொடர் எது?',
   4: 'பிரித்து எழுதுக: கொங்கலர்தார்',
   5: '‘துப்பார்க்குத் துப்பாய துப்பாக்கித் துப்பார்க்குத்’ - இடையினைக் கண்டறிக',
   6: '‘பொன்புனை மன்று ளாடும் பொற்கழல்’ - மோனையைத் தேர்க',
   7: '‘பணித்த சடையும் பவளம் போல் மேனியிற்பால் வெண்ணீறும்’ - அடி எதுகை சுட்டுக',
   8: '‘பாரதப் பூமி பழம்பெரும் பூமி நீரதன் புதல்வர் இந் நினைவகற் றாதீர்’ - சீர்மோனையைச் சுட்டுக',
   9: '‘நின்றனன் அவ்வழி நிகழ்ந்த தென்னெனில துன்றுபூஞ் சோலைவாய் அரக்கன்’ - சீர்மோனையைச் சுட்டுக',
   10: '‘அச்சில் வார்த்தாற் போல்’ - உவமையால் விளக்கப்பெறும் பொருத்தமானப் பொருளைத் தேர்ந்தெடுக்க',
   11: '‘தாமரை இலை தண்ணீர் போல’ - உவமையால் விளக்கப்பெறும் பொருத்தமானப் பொருளைத் தேர்ந்தெடுக்க',
   12: '‘அனலில் விழுந்த புழு போல’ - உவமையால் விளக்கப்பெறும் பொருத்தமானப் பொருளைத் தேர்ந்தெடுக்க',
   13: 'எது எழுவாய்? "பாம்பு பறந்து சீறி சென்றது"',
   14: '"பாப்பா மங்கு பால் குடித்தது". எது பயனிலை?',
   15: 'அப்புவின் கால்ச்சட்டை கிழிந்ததால் அழுதான். எது பயனிலை?',
   16: 'எதிர்சொல் தருக: அடைமழை',
   17: 'Aesthetic - என்ற ஆங்கில சொல்லின் பொருள்?',
   18: 'எதிர்சொல் தருக: சான்றோர்',
   19: 'பொருந்தாததைக் கண்டறிக',
   20: 'பின்வருவனவற்றுள் வினைத்தொகைக்கு பொருந்தாதது எது?'


}
let answers = {
   
   1: ['216', '247', '246', '217'],
   2: ['ஆகாரத்தில்', 'ஏகாரத்தில்', 'ஓகாரத்தில்', 'ஈகாரத்தில்'],
   3: ['அம்பு வீசி மான் குட்டியைக் காயப்படுத்தினான்', 'பனந்தோட்டத்தில் ஆந்தை அலறுவது கேள்', 'தென்னை ஓலையால் கீற்றுப் பின்னுவார்கள்', 'கஞ்சி சாப்பிட்டால் காய்ச்சலுக்கு நல்லது'],
   4: ['கொங்கலர் + தார்', 'கொ + கலர்தார்', 'கொங்கு + அலர் + தார்', 'கொங்க + அலர்தார்'],
   5: ['துப்பார்க்குத் - துப்பாய', 'துப்பார்க்குத் - துப்பார்க்குத்', 'துப்பார்க்குத் - துப்பாக்கி', 'துப்பாய - துப்பார்க்கு'],
   6: ['பொன்புனை - ளாடும்', 'பொன்புனை - பொற்கழல்', 'மன்று - ளாடும்', 'மன்று - பொற்கழல்'],
   7: ['பணித்த - மேனியிற்பால்', 'பணித்த - பவளம்', 'சடையும் - பவளம்', 'பணித்த - சடையும்'],
   8: ['பாரதப் பூமி - பழம்பெரும்', 'பழம்பெரும் - பாரதப் பூமி', 'நீரதன் - புதல்வர்', 'புதல்வர் - நினைவகற்'],
   9: ['நின்றனன் - அவ்வழி', 'நிகழ்ந்த - தென்னெனில', 'நின்றனன் - நிகழ்ந்த', 'நிகழ்ந்த - சோலைவாய்'],
   10: ['பொய்யானது', 'உண்மை தன்மை', 'கடுமையானது', 'வலிமையற்றது'],
   11: ['பற்று', 'சிறப்பு', 'மேன்மை', 'பற்று அற்று இருத்தல்'],
   12: ['துன்பம்', 'ஆறாத்துயரம்', 'மகிழ்ச்சி', 'சிறுமை'],
   13: ['பறந்து', 'சீறி', 'பாம்பு', 'சென்றது'],
   14: ['பாப்பா', 'மங்கு', 'பால்', 'குடித்தது'],
   15: ['அப்புவின்', 'கால்ச்சட்டை', 'அழுதான்', 'எதுவுமே இல்லை'],
   16: ['சிறுமழை', 'தூரல்', 'சாரல்', 'பெருமழை'],
   17: ['இயற்கை வனப்பு', 'இயற்கை அறிவு', 'இயற்கை ஒழுங்கு', 'இயற்கை உணவு'],
   18: ['ஆன்றோர்', 'மூடர்', 'அறிவிலார்', 'புல்லர்'],
   19: ['ஏலாதி', 'சிறுபஞ்சமூலம்', 'ஆசாரக்கோவை', 'திரிகடுகம்'],
   20: ['நீளிடை', 'கடனறிகாட்சி', 'இலைபொழில்', 'உகுநீர்']


}



for(let i=1; i<=20; i++){

  var[choice1, choice2, choice3, choice4] = answers[i];
  document.write(`${i}. ${questions[i]} <br /><br /> a. ${choice1} <br /> b. ${choice2} <br /> c. ${choice3} <br /> d. ${choice4}`);
  document.write('<br />');
  document.write('<br />');
  
};

