               
let questions = {

    1: 'சரியான விடையினை தேர்வு செய்க:',
    2: 'ஆறு வல்லின மெய் எழுத்துகளுக்கும் ஆறு மெல்லின எழுத்துக்களும்____________எழுத்துகள் எனப்படும்?',
    3: ' சில எழுத்துக்களுக்கு இடையே ஒலிக்கும் முயற்சி, பிறக்கும் இடம் ஆகியவற்றில் ஒற்றுமை உண்டு. இவ்வாறு ஒற்றுமை உள்ள எழுத்துகள்________எழுத்துகள் எனப்படும்?',
    4: 'தமிழ் எழுத்துகளில் எந்த எழுத்துக்கு மட்டும் இன எழுத்து இல்லை?'
 
 
 }
 let answers = {
    
    1: ['Internet - மின் இதழ்', 'Search - மின் நூல்', 'E-Journal - இணையம்', 'E-Book - தேடுபொறி'],
    2: ['இன எழுத்துகள்', 'உயிர் எழுத்துக்கள்', 'இனம் சேரா எழுத்துகள்', 'மெய் எழுத்துகள்'],
    3: ['உயிர் எழுத்துக்கள்', 'இன எழுத்துக்கள்', 'இனம் சேரா எழுத்துகள்', 'ஒற்று எழுத்துக்கள்'],
    4: ['உயிரெழுத்து', 'ஆயுத எழுத்து', 'மெய் எழுத்து', 'இவற்றில் எதுவுமில்லை']
 
 }
 
 
 
 for(let i=1; i<=4; i++){
 
   var[choice1, choice2, choice3, choice4] = answers[i];
   document.write(`${i}. ${questions[i]} <br /><br /> a. ${choice1} <br /> b. ${choice2} <br /> c. ${choice3} <br /> d. ${choice4}`);
   document.write('<br />');
   document.write('<br />');
   
 };
 
 